tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_TRDC.h
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT20_MASK (0x100000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT20_SHIFT (20U)
/*! BIT20 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT20(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT20_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT20_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT21_MASK (0x200000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT21_SHIFT (21U)
/*! BIT21 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT21(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT21_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT21_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT22_MASK (0x400000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT22_SHIFT (22U)
/*! BIT22 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT22(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT22_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT22_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT23_MASK (0x800000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT23_SHIFT (23U)
/*! BIT23 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT23(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT23_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT23_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT24_MASK (0x1000000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT24_SHIFT (24U)
/*! BIT24 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT24(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT24_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT24_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT25_MASK (0x2000000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT25_SHIFT (25U)
/*! BIT25 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT25(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT25_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT25_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT26_MASK (0x4000000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT26_SHIFT (26U)
/*! BIT26 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT26(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT26_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT26_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT27_MASK (0x8000000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT27_SHIFT (27U)
/*! BIT27 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT27(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT27_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT27_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT28_MASK (0x10000000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT28_SHIFT (28U)
/*! BIT28 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT28(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT28_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT28_MASK)

#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT29_MASK (0x20000000U)
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT29_SHIFT (29U)
/*! BIT29 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT29(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT29_SHIFT)) & TRDC_MBC_DOM12_MEM0_BLK_NSE_W_BIT29_MASK)

