tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_TRDC.h
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT3_MASK  (0x8U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT3_SHIFT (3U)
/*! BIT3 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT3(x)    (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT3_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT3_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT4_MASK  (0x10U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT4_SHIFT (4U)
/*! BIT4 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT4(x)    (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT4_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT4_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT5_MASK  (0x20U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT5_SHIFT (5U)
/*! BIT5 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT5(x)    (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT5_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT5_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT6_MASK  (0x40U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT6_SHIFT (6U)
/*! BIT6 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT6(x)    (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT6_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT6_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT7_MASK  (0x80U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT7_SHIFT (7U)
/*! BIT7 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT7(x)    (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT7_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT7_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT8_MASK  (0x100U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT8_SHIFT (8U)
/*! BIT8 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT8(x)    (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT8_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT8_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT9_MASK  (0x200U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT9_SHIFT (9U)
/*! BIT9 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT9(x)    (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT9_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT9_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT10_MASK (0x400U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT10_SHIFT (10U)
/*! BIT10 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT10(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT10_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT10_MASK)

#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT11_MASK (0x800U)
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT11_SHIFT (11U)
/*! BIT11 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT11(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT11_SHIFT)) & TRDC_MBC_DOM15_MEM3_BLK_NSE_W_BIT11_MASK)

