tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_TRDC.h
#define TRDC_MRC_DOM13_RGD_NSE_BIT5_MASK         (0x20U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT5_SHIFT        (5U)
/*! BIT5 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT5(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT5_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT5_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT6_MASK         (0x40U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT6_SHIFT        (6U)
/*! BIT6 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT6(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT6_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT6_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT7_MASK         (0x80U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT7_SHIFT        (7U)
/*! BIT7 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT7(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT7_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT7_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT8_MASK         (0x100U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT8_SHIFT        (8U)
/*! BIT8 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT8(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT8_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT8_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT9_MASK         (0x200U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT9_SHIFT        (9U)
/*! BIT9 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT9(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT9_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT9_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT10_MASK        (0x400U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT10_SHIFT       (10U)
/*! BIT10 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT10(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT10_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT10_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT11_MASK        (0x800U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT11_SHIFT       (11U)
/*! BIT11 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT11(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT11_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT11_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT12_MASK        (0x1000U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT12_SHIFT       (12U)
/*! BIT12 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT12(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT12_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT12_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT13_MASK        (0x2000U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT13_SHIFT       (13U)
/*! BIT13 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT13(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT13_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT13_MASK)

#define TRDC_MRC_DOM13_RGD_NSE_BIT14_MASK        (0x4000U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT14_SHIFT       (14U)
/*! BIT14 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT14(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT14_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT14_MASK)

