tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_TRDC.h
#define TRDC_MRC_DOM13_RGD_NSE_BIT15_MASK        (0x8000U)
#define TRDC_MRC_DOM13_RGD_NSE_BIT15_SHIFT       (15U)
/*! BIT15 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM13_RGD_NSE_BIT15(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM13_RGD_NSE_BIT15_SHIFT)) & TRDC_MRC_DOM13_RGD_NSE_BIT15_MASK)
/*! @} */

/* The count of TRDC_MRC_DOM13_RGD_NSE */
#define TRDC_MRC_DOM13_RGD_NSE_COUNT             (7U)

/*! @name MRC_DOM14_RGD_W - MRC Region Descriptor Word 0..MRC Region Descriptor Word 1 */
/*! @{ */

#define TRDC_MRC_DOM14_RGD_W_MRACSEL_MASK        (0x7U)
#define TRDC_MRC_DOM14_RGD_W_MRACSEL_SHIFT       (0U)
/*! MRACSEL - Memory Region Access Control Select
 *  0b000..Select MRC_GLBAC0 access control policy
 *  0b001..Select MRC_GLBAC1 access control policy
 *  0b010..Select MRC_GLBAC2 access control policy
 *  0b011..Select MRC_GLBAC3 access control policy
 *  0b100..Select MRC_GLBAC4 access control policy
 *  0b101..Select MRC_GLBAC5 access control policy
 *  0b110..Select MRC_GLBAC6 access control policy
 *  0b111..Select MRC_GLBAC7 access control policy
 */
#define TRDC_MRC_DOM14_RGD_W_MRACSEL(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_W_MRACSEL_SHIFT)) & TRDC_MRC_DOM14_RGD_W_MRACSEL_MASK)

#define TRDC_MRC_DOM14_RGD_W_VLD_MASK            (0x1U)
#define TRDC_MRC_DOM14_RGD_W_VLD_SHIFT           (0U)
/*! VLD - Valid */
#define TRDC_MRC_DOM14_RGD_W_VLD(x)              (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_W_VLD_SHIFT)) & TRDC_MRC_DOM14_RGD_W_VLD_MASK)

#define TRDC_MRC_DOM14_RGD_W_NSE_MASK            (0x10U)
#define TRDC_MRC_DOM14_RGD_W_NSE_SHIFT           (4U)
/*! NSE - NonSecure Enable
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in this register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_W_NSE(x)              (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_W_NSE_SHIFT)) & TRDC_MRC_DOM14_RGD_W_NSE_MASK)

#define TRDC_MRC_DOM14_RGD_W_END_ADDR_MASK       (0xFFFFC000U)
#define TRDC_MRC_DOM14_RGD_W_END_ADDR_SHIFT      (14U)
/*! END_ADDR - End Address */
#define TRDC_MRC_DOM14_RGD_W_END_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_W_END_ADDR_SHIFT)) & TRDC_MRC_DOM14_RGD_W_END_ADDR_MASK)

#define TRDC_MRC_DOM14_RGD_W_STRT_ADDR_MASK      (0xFFFFC000U)
#define TRDC_MRC_DOM14_RGD_W_STRT_ADDR_SHIFT     (14U)
/*! STRT_ADDR - Start Address */
#define TRDC_MRC_DOM14_RGD_W_STRT_ADDR(x)        (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_W_STRT_ADDR_SHIFT)) & TRDC_MRC_DOM14_RGD_W_STRT_ADDR_MASK)
/*! @} */

/* The count of TRDC_MRC_DOM14_RGD_W */
#define TRDC_MRC_DOM14_RGD_W_COUNT               (7U)

/* The count of TRDC_MRC_DOM14_RGD_W */
#define TRDC_MRC_DOM14_RGD_W_COUNT2              (16U)

/* The count of TRDC_MRC_DOM14_RGD_W */
#define TRDC_MRC_DOM14_RGD_W_COUNT3              (2U)

/*! @name MRC_DOM14_RGD_NSE - MRC Region Descriptor NonSecure Enable */
/*! @{ */

#define TRDC_MRC_DOM14_RGD_NSE_BIT0_MASK         (0x1U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT0_SHIFT        (0U)
/*! BIT0 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT0(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT0_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT0_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT1_MASK         (0x2U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT1_SHIFT        (1U)
/*! BIT1 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT1(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT1_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT1_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT2_MASK         (0x4U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT2_SHIFT        (2U)
/*! BIT2 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT2(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT2_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT2_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT3_MASK         (0x8U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT3_SHIFT        (3U)
/*! BIT3 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT3(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT3_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT3_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT4_MASK         (0x10U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT4_SHIFT        (4U)
/*! BIT4 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT4(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT4_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT4_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT5_MASK         (0x20U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT5_SHIFT        (5U)
/*! BIT5 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT5(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT5_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT5_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT6_MASK         (0x40U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT6_SHIFT        (6U)
/*! BIT6 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT6(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT6_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT6_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT7_MASK         (0x80U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT7_SHIFT        (7U)
/*! BIT7 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT7(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT7_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT7_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT8_MASK         (0x100U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT8_SHIFT        (8U)
/*! BIT8 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT8(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT8_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT8_MASK)

#define TRDC_MRC_DOM14_RGD_NSE_BIT9_MASK         (0x200U)
#define TRDC_MRC_DOM14_RGD_NSE_BIT9_SHIFT        (9U)
/*! BIT9 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM14_RGD_NSE_BIT9(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM14_RGD_NSE_BIT9_SHIFT)) & TRDC_MRC_DOM14_RGD_NSE_BIT9_MASK)

