tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_TRDC.h
#define TRDC_MRC_DOM15_RGD_NSE_BIT11_MASK        (0x800U)
#define TRDC_MRC_DOM15_RGD_NSE_BIT11_SHIFT       (11U)
/*! BIT11 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM15_RGD_NSE_BIT11(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM15_RGD_NSE_BIT11_SHIFT)) & TRDC_MRC_DOM15_RGD_NSE_BIT11_MASK)

#define TRDC_MRC_DOM15_RGD_NSE_BIT12_MASK        (0x1000U)
#define TRDC_MRC_DOM15_RGD_NSE_BIT12_SHIFT       (12U)
/*! BIT12 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM15_RGD_NSE_BIT12(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM15_RGD_NSE_BIT12_SHIFT)) & TRDC_MRC_DOM15_RGD_NSE_BIT12_MASK)

#define TRDC_MRC_DOM15_RGD_NSE_BIT13_MASK        (0x2000U)
#define TRDC_MRC_DOM15_RGD_NSE_BIT13_SHIFT       (13U)
/*! BIT13 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM15_RGD_NSE_BIT13(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM15_RGD_NSE_BIT13_SHIFT)) & TRDC_MRC_DOM15_RGD_NSE_BIT13_MASK)

#define TRDC_MRC_DOM15_RGD_NSE_BIT14_MASK        (0x4000U)
#define TRDC_MRC_DOM15_RGD_NSE_BIT14_SHIFT       (14U)
/*! BIT14 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM15_RGD_NSE_BIT14(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM15_RGD_NSE_BIT14_SHIFT)) & TRDC_MRC_DOM15_RGD_NSE_BIT14_MASK)

#define TRDC_MRC_DOM15_RGD_NSE_BIT15_MASK        (0x8000U)
#define TRDC_MRC_DOM15_RGD_NSE_BIT15_SHIFT       (15U)
/*! BIT15 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM15_RGD_NSE_BIT15(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM15_RGD_NSE_BIT15_SHIFT)) & TRDC_MRC_DOM15_RGD_NSE_BIT15_MASK)
/*! @} */

/* The count of TRDC_MRC_DOM15_RGD_NSE */
#define TRDC_MRC_DOM15_RGD_NSE_COUNT             (7U)


/*!
 * @}
 */ /* end of group TRDC_Register_Masks */


/*!
 * @}
 */ /* end of group TRDC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_TRDC_H_ */

